README.md

# Table of Contents

1.  [General Policies](#org5a2c221)
    1.  [Grading](#orgfda03a8)
        1.  [Final Exam](#orga9c3717)
        2.  [Groups](#orgf2a0acc)
        3.  [Discussions & Exercises](#orge537c9f)
    2.  [Readings](#org0aec62f)
2.  [Other Resources](#org0f0d9ae)
    1.  [Friday Sections](#org30a64ee)
    2.  [HowTos](#org1905c49)
3.  [Topics](#org6df211c)
    1.  [Multiple Equation Models](#org835f6c9)
    2.  [Some Non-parametrics](#orga477046)
    3.  [Causality & Correlation](#orgc6c28e3)
    4.  [Identification & Instrumental Variables](#org4fe3f56)
    5.  [Generalized Method of Moments](#orgef002ff)
    6.  [Discrete Choice & Maximum Likelihood](#org7d7e6fe)
    7.  [Resampling &  the Bootstrap](#org9420561)
    8.  [Cross-Validation & Other Ideas from Machine Learning](#org812b210)

For class-related conversations, please go to [piazza.com](https://piazza.com/class/km9z4xiuham24j).


<a id="org5a2c221"></a>

# General Policies

Discussion of administrative issues: [[video](https://drive.google.com/file/d/1lrcl99dxnaH2APiQ7d5EwppcpMbhpM8-)]


<a id="orgfda03a8"></a>

## Grading


<a id="orga9c3717"></a>

### Final Exam

The final exam will be &ldquo;take-home&rdquo;, and be made available by 11am on
Monday, May 9 (if there is a **consensus** that an earlier date is
preferable then we can reschedule).  You will have 24 hours to
complete the final.


<a id="orgf2a0acc"></a>

### Groups

You should regard yourself as a member of a **group**, and your
group will be responsible for working together on certain
assignments.  Group sizes should be between 3&#x2013;6 (inclusive).  


<a id="orge537c9f"></a>

### Discussions & Exercises

We will provide a combination of exercises and problems for
discussion.  These are in lieu of formal individual problem sets.  

1.  Exercises

    You are **required** to work on the exercises with other students in
    the class.  Your **group** should turn in *one* set of notes and
    proposed solutions to the exercises.   I will provide a set of
    exercises for each of our major topics.   These are called
    *exercises* because they are meant more as tests of comprehension
    than as more difficult *problems*.  Exercises will be graded on a
    &ldquo;check&rdquo;, &ldquo;check +&rdquo;, &ldquo;check -&rdquo; system.  
    
    Not turning in an exercise will be much worse for the grades of
    people in your group than receiving a &ldquo;check -&rdquo;.

2.  Discussions

    *Problems* will be the focus of broader class discussion on `piazza.com`.  Your
    participation and contributions in these discussions will be
    *individually* graded.
    
    My intention is to post different discussion prompts every week.
    There are two things (well, five) I then ask of you each week: 
    
    -   Respond to *two* or more of my discussion prompts.  
        Please post these responses earlier rather than later.
    
    -   Comment on at least *three* of the posts responding to the
        discussion prompt (i.e., comment on others comments).  A
        livelier discussion will result if you don&rsquo;t wait until the
        last minute to post these comments, so that there&rsquo;s some
        opportunity for dialog.
    
    The goal here is to have constructive discussions, to help us all
    in our thinking about interesting topics in econometrics.  Our
    &ldquo;grading&rdquo; of your remarks will be restricted to counting them and
    to noting when we think your remarks are good (we&rsquo;ll &ldquo;like&rdquo; them).
    The bar for a good remark isn&rsquo;t really very high&#x2013;we just want to
    see that you&rsquo;re contributing constructively to the conversation.
    We&rsquo;re basically looking for active, constructive participation.
    It&rsquo;s perfectly fine for you to have little filler remarks, like
    &ldquo;great question!&rdquo;, but we&rsquo;d hope to see other remarks with more
    substantive thought or content.
    
    The main way to receive a poor individual assessment for the
    discussions is not to participate in them.  If you feel shy about
    sharing your thoughts with the class, piazza allows you to post in
    such a way that your classmates can&rsquo;t identify you (you could also
    post fully anonymously, but in this case the instructors can&rsquo;t
    give you credit).


<a id="org0aec62f"></a>

## Readings

-   &ldquo;Hansen&rdquo; refers to Bruce Hansen&rsquo;s [Econometrics Textbook](https://www.ssc.wisc.edu/~bhansen/econometrics/Econometrics.pdf).  This is
    freely available on-line, and is soon to be published by Princeton.
-   Unresolved references of the form &ldquo;<sup id="70bc29f9115e168f8de3f30f59f19fa5"><a href="#foo84" title="">foo84</a></sup>&rdquo; or similar are keys
    with values that can be looked up in
    [are212.bib](are212.bib).  This last is a bibtex database which
    you&rsquo;re free to use.  The bibtex file includes some links to pdf
    files which you may find useful.


<a id="org0f0d9ae"></a>

# Other Resources


<a id="org30a64ee"></a>

## Friday Sections

Lucy Hackett will hold weekly sections on Fridays.  She&rsquo;ll present
material pertaining to both econometrics and programming.

It&rsquo;s critical to note that we expect you to develop some fluency in
the programming language `python`.  


<a id="org1905c49"></a>

## HowTos

-   **GitHub:** How to view, files, fork, edit, and issue pull requests
    (PRs).  <https://youtu.be/krDQk5ZzP8U>
-   **GitHub to DataHub:** How to use datahub to run & edit code from
    github:  <https://youtu.be/HBM8jgvYPtA>
-   **Python Bootcamp:** [[datahub](http://datahub.berkeley.edu/user-redirect/interact?account=acwatt&repo=are212-bootcamp&branch=master&path=)][[github](https://github.com/acwatt/are212-bootcamp)]


<a id="org6df211c"></a>

# Topics

Discussion of topics for 2nd half of course: [[video](https://drive.google.com/file/d/1MmyeW71lNVixYoXcuJTHjdBk-Fu7kpq_)]


<a id="org835f6c9"></a>

## Multiple Equation Models


<a id="orga477046"></a>

## Some Non-parametrics


<a id="orgc6c28e3"></a>

## Causality & Correlation


<a id="org4fe3f56"></a>

## Identification & Instrumental Variables


<a id="orgef002ff"></a>

## Generalized Method of Moments


<a id="org7d7e6fe"></a>

## Discrete Choice & Maximum Likelihood


<a id="org9420561"></a>

## Resampling &  the Bootstrap


<a id="org812b210"></a>

## Cross-Validation & Other Ideas from Machine Learning

